import numpy as np

# 定义相机内参矩阵K (请替换为实际参数)

K =  np.array([[2787.92123871456, 0, 1319.23947109118],
               [0, 2731.92041136203, 1305.90610350384],
               [0, 0, 1]])# 提供的内参矩阵
# 定义相机旋转矩阵R (请替换为实际旋转矩阵)
R = np.array([[-0.0196315683830494, -0.999552336248043, -0.0225771704139613],
              [0.928922425489938, -0.0265862769092025, 0.369318693409902],
              [-0.369753605722394, -0.0137221347168217, 0.929028510904860]])  # 提供的旋转矩阵

# # 像素距离p(m)
# p = 1.7e-6

# # 相机焦距f(m)
# f = 0.026

# 俯仰角
pitch_angle = 24

#拍摄高度H(m)
H = 720
T = np.array([[0], [0], [H]])  # 假设相机的平移向量
#预选框大小(px)
window_size = 300

#滑动步长(px)
step_size = 150